open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn.c
static void test_state_observer(void)
{
  static const enum bkvoice_turn_state_e expected[] =
  {
    BKVOICE_TURN_CAPTURING,
    BKVOICE_TURN_WAITING_TTS,
    BKVOICE_TURN_PLAYING,
    BKVOICE_TURN_IDLE,
    BKVOICE_TURN_CAPTURING,
    BKVOICE_TURN_FAULTED,
    BKVOICE_TURN_IDLE,
  };
  struct test_state_observer_s observer;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;

  memset(&observer, 0, sizeof(observer));
  test_initialize(&turn, &audio);
  assert(bkvoice_turn_set_state_observer(NULL, test_state_changed,
                                         &observer) == -EINVAL);
  assert(bkvoice_turn_set_state_observer(&turn, test_state_changed,
                                         &observer) == 0);
  assert(observer.trace_count == 0);

  assert(bkvoice_turn_session_open(&turn, 9) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 9, 1, 100, &token) == 0);
  assert(bkvoice_turn_set_state_observer(&turn, NULL, NULL) == -EBUSY);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 200) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 300) == 0);
  event.sequence = 2;
  assert(bkvoice_turn_tts_end(&turn, &event) == 0);

  audio.fail_stage = TEST_MIC_RELEASE;
  audio.fail_count = 1;
  assert(bkvoice_turn_ptt_down(&turn, 9, 3, 400, &token) == 0);
  event = test_event(&token, 4);
  assert(bkvoice_turn_ptt_up(&turn, &event, 500) == -EIO);
  assert(bkvoice_turn_recover(&turn) == 0);

  assert(observer.trace_count == sizeof(expected) / sizeof(expected[0]));
  assert(memcmp(observer.trace, expected, sizeof(expected)) == 0);
}

static void test_order_replay_and_cancel(void)
{
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;
  uint8_t pcm[TEST_FRAME_BYTES] = {0};
  size_t trace_count;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_session_open(&turn, 4) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 4, 1, 0, &token) == 0);
  trace_count = audio.trace_count;
  assert(bkvoice_turn_ptt_down(&turn, 4, 2, 0, &event) == -EBUSY);
  assert(audio.trace_count == trace_count);

  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 1) == -EPERM);
  assert(turn.last_downlink_sequence == 1);
  event = test_event(&token, 3);
  event.session_id++;
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -ESTALE);
  event.session_id--;
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -EALREADY);
  event.sequence = 1;
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -ESTALE);

  event = test_event(&token, 2);
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm),
                                1) == -EPERM);
  assert(turn.last_downlink_sequence == 2);
  event.sequence = 3;
  assert(bkvoice_turn_tts_start(&turn, &event, 1) == 0);
  assert(bkvoice_turn_tts_start(&turn, &event, 1) == -EALREADY);
  event.sequence = 5;
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm),
                                1) == -EPROTO);
  assert(turn.last_downlink_sequence == 3);
  assert(bkvoice_turn_ptt_down(&turn, 4, 4, 1, &event) == -EBUSY);

  event = test_event(&token, 5);
  assert(bkvoice_turn_cancel(&turn, &event, -ECANCELED) == 0);
  test_assert_idle(&turn, &audio);
  assert(bkvoice_turn_cancel(&turn, &event, -ECANCELED) == -ESTALE);
  trace_count = audio.trace_count;
  assert(bkvoice_turn_ptt_down(&turn, 4, 1, 2, &event) == -ESTALE);
  assert(bkvoice_turn_ptt_down(&turn, 4, 7, 2, &event) == -EPROTO);
  assert(audio.trace_count == trace_count);
  event = test_event(&token, 4);
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm),
                                2) == -ESTALE);
}

static void test_timeouts(void)
{
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_snapshot_s snapshot;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_timeout(&turn, 0) == -EALREADY);
  assert(bkvoice_turn_session_open(&turn, 1) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 1, 1, 10, &token) == 0);
  assert(bkvoice_turn_timeout(&turn, 1009) == -EAGAIN);
  assert(bkvoice_turn_timeout(&turn, 1010) == 0);
  test_assert_idle(&turn, &audio);
  bkvoice_turn_snapshot(&turn, &snapshot);
  assert(snapshot.last_error == -ETIMEDOUT);

  assert(bkvoice_turn_ptt_down(&turn, 1, 2, 20, &token) == 0);
  event = test_event(&token, 3);
  assert(bkvoice_turn_ptt_up(&turn, &event, 30) == 0);
  assert(bkvoice_turn_timeout(&turn, 2030) == 0);
  test_assert_idle(&turn, &audio);

  assert(bkvoice_turn_ptt_down(&turn, 1, 4, 40, &token) == 0);
  event = test_event(&token, 5);
  assert(bkvoice_turn_ptt_up(&turn, &event, 50) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 60) == 0);
  assert(bkvoice_turn_timeout(&turn, 3060) == 0);
  test_assert_idle(&turn, &audio);

  assert(bkvoice_turn_ptt_down(&turn, 1, 6,
                               UINT64_MAX - 10u, &token) == 0);
  assert(turn.deadline_ms == UINT64_MAX);
  event = test_event(&token, 7);
  assert(bkvoice_turn_cancel(&turn, &event, 0) == 0);
}

static void test_mic_failures(void)
{
  const enum test_stage_e startup[] =
  {
    TEST_MIC_ACQUIRE, TEST_MIC_PREPARE, TEST_MIC_START,
  };
  const enum test_stage_e shutdown[] =
  {
    TEST_MIC_STOP, TEST_MIC_DRAIN, TEST_MIC_RELEASE,
  };
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;
  size_t index;

  for (index = 0; index < sizeof(startup) / sizeof(startup[0]); index++)
    {
      test_initialize(&turn, &audio);
      assert(bkvoice_turn_session_open(&turn, 2) == 0);
      audio.fail_stage = startup[index];
      audio.fail_count = 1;
      assert(bkvoice_turn_ptt_down(&turn, 2, 1, 0, &token) == -EIO);
      test_assert_idle(&turn, &audio);
    }

  for (index = 0; index < sizeof(shutdown) / sizeof(shutdown[0]); index++)
    {
      test_initialize(&turn, &audio);
      assert(bkvoice_turn_session_open(&turn, 2) == 0);
      assert(bkvoice_turn_ptt_down(&turn, 2, 1, 0, &token) == 0);
      audio.fail_stage = shutdown[index];
      audio.fail_count = 1;
      event = test_event(&token, 2);
      assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -EIO);
      if (shutdown[index] == TEST_MIC_RELEASE)
        {
          assert(turn.state == BKVOICE_TURN_FAULTED);
          assert(audio.mic_owned);
          assert(bkvoice_turn_timeout(&turn, 10000) == -EIO);
          audio.fail_stage = 0;
          assert(bkvoice_turn_recover(&turn) == 0);
        }

      test_assert_idle(&turn, &audio);
    }

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_session_open(&turn, 2) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 2, 1, 0, &token) == 0);
  audio.strict_release = true;
  audio.fail_stage = TEST_MIC_STOP;
  audio.fail_count = 1;
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == -EIO);
  assert(turn.state == BKVOICE_TURN_FAULTED && audio.mic_owned);
  audio.strict_release = false;
  assert(bkvoice_turn_recover(&turn) == 0);
  test_assert_idle(&turn, &audio);

  assert(bkvoice_turn_recover(&turn) == -EALREADY);
}

static void test_prepare_playing(struct bkvoice_turn_s *turn,
                                 struct test_audio_s *audio,
                                 struct bkvoice_turn_token_s *token)
{
  struct bkvoice_turn_token_s event;

  test_initialize(turn, audio);
  assert(bkvoice_turn_session_open(turn, 3) == 0);
  assert(bkvoice_turn_ptt_down(turn, 3, 1, 0, token) == 0);
  event = test_event(token, 2);
  assert(bkvoice_turn_ptt_up(turn, &event, 1) == 0);
  event = test_event(token, 1);
  assert(bkvoice_turn_tts_start(turn, &event, 2) == 0);
}

static void test_dac_failures(void)
{
  const enum test_stage_e startup[] =
  {
    TEST_DAC_ACQUIRE, TEST_DAC_PREPARE, TEST_DAC_START,
  };
  const enum test_stage_e shutdown[] =
  {
    TEST_DAC_DRAIN, TEST_DAC_STOP, TEST_DAC_RELEASE,
  };
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;
  uint8_t pcm[TEST_FRAME_BYTES] = {0};
  size_t index;

