open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_turn.c
  for (index = 0; index < sizeof(startup) / sizeof(startup[0]); index++)
    {
      test_initialize(&turn, &audio);
      assert(bkvoice_turn_session_open(&turn, 3) == 0);
      assert(bkvoice_turn_ptt_down(&turn, 3, 1, 0, &token) == 0);
      event = test_event(&token, 2);
      assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
      audio.fail_stage = startup[index];
      audio.fail_count = 1;
      event = test_event(&token, 1);
      assert(bkvoice_turn_tts_start(&turn, &event, 2) == -EIO);
      test_assert_idle(&turn, &audio);
    }

  test_prepare_playing(&turn, &audio, &token);
  audio.fail_stage = TEST_DAC_WRITE;
  audio.fail_count = 1;
  event = test_event(&token, 2);
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm), 3) ==
         -EIO);
  test_assert_idle(&turn, &audio);

  test_prepare_playing(&turn, &audio, &token);
  audio.partial_write = true;
  event = test_event(&token, 2);
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm, sizeof(pcm), 3) ==
         -EIO);
  test_assert_idle(&turn, &audio);

  for (index = 0; index < sizeof(shutdown) / sizeof(shutdown[0]); index++)
    {
      test_prepare_playing(&turn, &audio, &token);
      audio.fail_stage = shutdown[index];
      audio.fail_count = 1;
      event = test_event(&token, 2);
      assert(bkvoice_turn_tts_end(&turn, &event) == -EIO);
      if (shutdown[index] == TEST_DAC_RELEASE)
        {
          assert(turn.state == BKVOICE_TURN_FAULTED);
          assert(audio.dac_owned);
          audio.fail_stage = 0;
          assert(bkvoice_turn_recover(&turn) == 0);
        }

      test_assert_idle(&turn, &audio);
    }

  test_prepare_playing(&turn, &audio, &token);
  audio.strict_release = true;
  audio.fail_stage = TEST_DAC_STOP;
  audio.fail_count = 1;
  event = test_event(&token, 2);
  assert(bkvoice_turn_tts_end(&turn, &event) == -EIO);
  assert(turn.state == BKVOICE_TURN_FAULTED && audio.dac_owned);
  audio.strict_release = false;
  assert(bkvoice_turn_recover(&turn) == 0);
  test_assert_idle(&turn, &audio);
}

static void test_session_lifecycle(void)
{
  struct bkvoice_turn_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_session_close(&turn, 0) == -EALREADY);
  assert(bkvoice_turn_session_open(&turn, 5) == 0);
  assert(bkvoice_turn_session_open(&turn, 6) == -EBUSY);
  assert(bkvoice_turn_ptt_down(&turn, 5, 1, 0, &token) == 0);
  assert(bkvoice_turn_session_close(&turn, -ENOTCONN) == 0);
  test_assert_idle(&turn, &audio);
  bkvoice_turn_snapshot(&turn, &snapshot);
  assert(snapshot.session_id == 0 && snapshot.last_session_id == 5);
  assert(snapshot.last_error == -ENOTCONN);
  assert(bkvoice_turn_ptt_down(&turn, 5, 2, 0, &token) == -ENOTCONN);
  assert(bkvoice_turn_session_open(&turn, 5) == -ESTALE);
  assert(bkvoice_turn_session_open(&turn, 4) == -ESTALE);
  assert(bkvoice_turn_session_open(&turn, 6) == 0);
  struct bkvoice_turn_token_s old_token = test_event(&token, 2);
  assert(bkvoice_turn_ptt_down(&turn, 6, 1, 0, &token) == 0);
  assert(token.session_id == 6 && token.turn_id == 1);
  assert(bkvoice_turn_ptt_up(&turn, &old_token, 1) == -ESTALE);
  assert(bkvoice_turn_session_close(&turn, 0) == 0);
  turn.last_session_id = UINT32_MAX;
  assert(bkvoice_turn_session_open(&turn, 7) == -EOVERFLOW);
}

static void test_validation_and_overflow(void)
{
  struct bkvoice_turn_audio_ops_s bad_ops = g_test_ops;
  struct bkvoice_turn_limits_s bad_limits = g_test_limits;
  struct bkvoice_turn_token_s token;
  struct bkvoice_turn_token_s event;
  struct bkvoice_turn_s turn;
  struct test_audio_s audio;
  uint8_t pcm[TEST_FRAME_BYTES] = {0};

  memset(&turn, 0, sizeof(turn));
  memset(&audio, 0, sizeof(audio));
  assert(bkvoice_turn_initialize(NULL, &g_test_ops, &audio,
                                 &g_test_limits, 7) == -EINVAL);
  bad_ops.dac_write = NULL;
  assert(bkvoice_turn_initialize(&turn, &bad_ops, &audio,
                                 &g_test_limits, 7) == -EINVAL);
  bad_limits.audio_frame_bytes = 0;
  assert(bkvoice_turn_initialize(&turn, &g_test_ops, &audio,
                                 &bad_limits, 7) == -EINVAL);

  test_initialize(&turn, &audio);
  assert(bkvoice_turn_ptt_down(&turn, 1, 1, 0, &token) == -ENOTCONN);
  assert(bkvoice_turn_session_open(&turn, 1) == 0);
  turn.last_turn_id = UINT32_MAX;
  assert(bkvoice_turn_ptt_down(&turn, 1, 1, 0, &token) == -EOVERFLOW);
  assert(turn.session_id == 0 && turn.last_error == -EOVERFLOW);
  test_assert_idle(&turn, &audio);

  assert(bkvoice_turn_session_open(&turn, 2) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 2, 1, 0, &token) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 1) == 0);
  event = test_event(&token, 1);
  assert(bkvoice_turn_tts_start(&turn, &event, 2) == 0);
  event.sequence = 2;
  assert(bkvoice_turn_tts_audio(&turn, &event, pcm,
                                sizeof(pcm) - 1u, 3) == -EMSGSIZE);
  assert(turn.last_downlink_sequence == 2);
  test_assert_idle(&turn, &audio);

  assert(bkvoice_turn_ptt_down(&turn, 2, 3, 4, &token) == 0);
  event = test_event(&token, 4);
  assert(bkvoice_turn_ptt_up(&turn, &event, 5) == 0);
  event = test_event(&token, 3);
  assert(bkvoice_turn_tts_start(&turn, &event, 6) == 0);
  event.sequence = 4;
  assert(bkvoice_turn_tts_audio(&turn, &event, NULL,
                                sizeof(pcm), 7) == -EINVAL);
  assert(turn.last_downlink_sequence == 4);
  test_assert_idle(&turn, &audio);

  turn.last_control_sequence = UINT32_MAX - 1u;
  assert(bkvoice_turn_ptt_down(&turn, 2, UINT32_MAX, 8, &token) ==
         -EOVERFLOW);
  assert(turn.session_id == 0 && turn.last_error == -EOVERFLOW);
  assert(!audio.mic_owned && !audio.dac_owned);

  assert(bkvoice_turn_session_open(&turn, 3) == 0);
  assert(bkvoice_turn_ptt_down(&turn, 3, 1, 9, &token) == 0);
  event = test_event(&token, 2);
  assert(bkvoice_turn_ptt_up(&turn, &event, 10) == 0);
  turn.last_downlink_sequence = UINT32_MAX - 1u;
  event = test_event(&token, UINT32_MAX);
  assert(bkvoice_turn_tts_start(&turn, &event, 11) == -EOVERFLOW);
  assert(turn.session_id == 0 && turn.last_error == -EOVERFLOW);
  assert(!audio.mic_owned && !audio.dac_owned);
}

int main(void)
{
  test_normal_turn();
  test_state_observer();
  test_order_replay_and_cancel();
  test_timeouts();
  test_mic_failures();
  test_dac_failures();
  test_session_lifecycle();
  test_validation_and_overflow();
  printf("BKVOICE_TURN_HOST_PASS\n");
  return 0;
}
